42crunch.vscode-openapi
adamsome.vscode-theme-gruvbox-minor
akamud.vscode-theme-onedark
alefragnani.project-manager
alexkrechik.cucumberautocomplete
amazonwebservices.aws-toolkit-vscode
angelmaneuver.wallpaper-setting
arjun.swagger-viewer
asvetliakov.run-current-test
atlassian.atlascode
beardedbear.beardedicons
brandonkirbyson.vscode-animations
cameron.vscode-pytest
christian-kohler.path-intellisense
cstuder.gitlab-ci-validator
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.python-environment-manager
drcika.apc-extension
eamodio.gitlens
ecmel.vscode-html-css
emilylilylime.vscode-test-explorer-diagnostics
esbenp.prettier-vscode
figma.figma-vscode-extension
george-alisson.html-preview-vscode
gerrnperl.outline-map
github.copilot
github.copilot-chat
github.github-vscode-theme
github.vscode-github-actions
github.vscode-pull-request-github
gitlab.gitlab-workflow
graphql.vscode-graphql
graphql.vscode-graphql-execution
graphql.vscode-graphql-syntax
harryhopkinson.vim-theme
hbenl.vscode-test-explorer
hsnazar.hyper-term-theme
jackpaget.gruvbox-glass
jdinhlife.gruvbox
joshmu.periscope
jpcrs.binocular
lehni.vscode-fix-checksums
lharri73.dbc
lukegeneva.auto-collapse-explorer
magdalenalipka.tokyo-night-frameless
mcu-debug.debug-tracker-vscode
mcu-debug.memory-view
mcu-debug.peripheral-viewer
mcu-debug.rtos-views
mhutchie.git-graph
miguelsolorio.fluent-icons
mikestead.dotenv
monokai.theme-monokai-pro-vscode
ms-azuretools.vscode-docker
ms-playwright.playwright
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.test-adapter-converter
nautigsam.go-to-test
pkief.material-icon-theme
quicktype.quicktype
rangav.vscode-thunder-client
redhat.vscode-yaml
shd101wyy.markdown-preview-enhanced
sr-team.vscode-autohide-fork
supermaven.supermaven
svanteboberg.svant-vscode-fzf
tamasfe.even-better-toml
teabyii.ayu
tompollak.lazygit-vscode
tomrijndorp.find-it-faster
twxs.cmake
usernamehw.errorlens
vintharas.learn-vim
vitest.explorer
vscodevim.vim
wallabyjs.quokka-vscode
xaver.clang-format
yoavbls.pretty-ts-errors
42crunch.vscode-openapi
adamsome.vscode-theme-gruvbox-minor
akamud.vscode-theme-onedark
alefragnani.project-manager
alexkrechik.cucumberautocomplete
amazonwebservices.aws-toolkit-vscode
angelmaneuver.wallpaper-setting
arjun.swagger-viewer
asvetliakov.run-current-test
beardedbear.beardedicons
brandonkirbyson.vscode-animations
cameron.vscode-pytest
christian-kohler.path-intellisense
continue.continue
cstuder.gitlab-ci-validator
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.python-environment-manager
drcika.apc-extension
eamodio.gitlens
ecmel.vscode-html-css
emilylilylime.vscode-test-explorer-diagnostics
esbenp.prettier-vscode
figma.figma-vscode-extension
george-alisson.html-preview-vscode
github.copilot
github.copilot-chat
github.github-vscode-theme
github.vscode-github-actions
github.vscode-pull-request-github
gitlab.gitlab-workflow
graphql.vscode-graphql
graphql.vscode-graphql-execution
graphql.vscode-graphql-syntax
gruntfuggly.todo-tree
harryhopkinson.vim-theme
hbenl.vscode-test-explorer
hsnazar.hyper-term-theme
jackpaget.gruvbox-glass
jdinhlife.gruvbox
joshmu.periscope
jpcrs.binocular
lehni.vscode-fix-checksums
lharri73.dbc
lukegeneva.auto-collapse-explorer
magdalenalipka.tokyo-night-frameless
mcu-debug.debug-tracker-vscode
mcu-debug.memory-view
mcu-debug.peripheral-viewer
mcu-debug.rtos-views
mhutchie.git-graph
miguelsolorio.fluent-icons
mikestead.dotenv
monokai.theme-monokai-pro-vscode
ms-azuretools.vscode-docker
ms-playwright.playwright
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.test-adapter-converter
nautigsam.go-to-test
pkief.material-icon-theme
quicktype.quicktype
rangav.vscode-thunder-client
redhat.vscode-yaml
shd101wyy.markdown-preview-enhanced
sr-team.vscode-autohide-fork
supermaven.supermaven
svanteboberg.svant-vscode-fzf
tamasfe.even-better-toml
teabyii.ayu
tompollak.lazygit-vscode
tomrijndorp.find-it-faster
twxs.cmake
usernamehw.errorlens
vintharas.learn-vim
vitest.explorer
vscodevim.vim
wallabyjs.quokka-vscode
xaver.clang-format
yoavbls.pretty-ts-errors
